app/controllers/sessions_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "teacher@example.com"], ["LIMIT", 1]]
---
  def create
    user = Teacher.find_by(email: params[:email])