app/controllers/students_controller.rb

INSERT INTO "students" ("name", "subject", "marks", "is_deleted", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "aa"], ["subject", "ee"], ["marks", 44], ["is_deleted", nil], ["teacher_id", 1], ["created_at", "2024-08-07 12:07:39.357428"], ["updated_at", "2024-08-07 12:07:39.357428"]]
---
  def create
    @student = Student.new(student_params)
    @student.teacher_id = session[:user_id]
    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "subject" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["name", "ffff"], ["subject", "eee"], ["updated_at", "2024-08-07 10:44:34.423281"], ["id", 4]]
---
  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "is_deleted" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["is_deleted", true], ["updated_at", "2024-08-07 12:07:54.921515"], ["id", 1]]
---
  def delete_student
    @student = Student.find(params[:id])
    @student.is_deleted = true
    @student.save