app/controllers/teachers_controller.rb

  def home
    @students = Student.where(is_deleted: false).all
---
SELECT "students".* FROM "students" WHERE "students"."is_deleted" = $1  [["is_deleted", false]]